GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Libraries/USB_OTG_Lib/Driver/inc/usb_reg.h
    __IM  uint32_t  RESERVED5[64];

    OUT_EP_T EP_OUT[8];

} USB_OTG_DEVICE_T;


/**
  * @brief USB on-the-go full-speed and high-speed (OTG_FS_PWRCLK/OTG_HS_PWRCLK)
  */

typedef struct
{

    union
    {
        __IOM uint32_t PCGCTRL;

        struct
        {
            __IOM uint32_t PCLKSTOP   : 1;
            __IOM uint32_t GCLK       : 1;
            __IM  uint32_t            : 2;
            __IOM uint32_t PHYSUS     : 1;
        } PCGCTRL_B;
    } ;
} USB_OTG_PWRCLK_T;

/**
  * @brief USB on-the-go full-speed and high-speed (OTG_FS_FIFO/OTG_HS_FIFO)
  */
typedef struct
{
    __IOM uint32_t DATA;

    __IM uint32_t RESERVED[1023];
} USB_OTG_FIFO_DATA_T;

typedef struct
{
    USB_OTG_FIFO_DATA_T FIFO[11];

} USB_OTG_FIFO_T;

/**@} end of group USB_Reg_Structures */

/** @defgroup USB_Reg_Macros Macros
  @{
*/

/* USB OTG base address in the bit-band region */
#define USB_OTG_FS_BASE        ((uint32_t)0x50000000)
#define USB_OTG_HS_BASE        ((uint32_t)0x40040000)

#ifdef USB_OTG_FS
#define USB_OTG_BASE            USB_OTG_FS_BASE
#else
#define USB_OTG_BASE            USB_OTG_HS_BASE
#endif

#define USB_OTG_HS2_BASE       ((uint32_t)USB_OTG_BASE + 0x200)
#define USB_OTG_HOST_BASE      ((uint32_t)USB_OTG_BASE + 0x400)
#define USB_OTG_DEVICE_BASE    ((uint32_t)USB_OTG_BASE + 0x800)
#define USB_OTG_PWRCLK_BASE    ((uint32_t)USB_OTG_BASE + 0xE00)
#define USB_OTG_FIFO_BASE      ((uint32_t)USB_OTG_BASE + 0x1000)
#define USB_OTG_FIFO_OFFSET     0x1000

/* USB on-the-go registers */
#define USB_OTG_G              ((USB_OTG_GLOBAL_T *) USB_OTG_BASE)
#define USB_OTG_H              ((USB_OTG_HOST_T *) USB_OTG_HOST_BASE)
#define USB_OTG_D              ((USB_OTG_DEVICE_T *) USB_OTG_DEVICE_BASE)
#define USB_OTG_PWR            ((USB_OTG_PWRCLK_T *) USB_OTG_PWRCLK_BASE)
#define USB_OTG_HS2            ((USB_OTG_HS2_T *) USB_OTG_HS2_BASE)

#define USB_OTG_FIFO           ((USB_OTG_FIFO_T *) USB_OTG_FIFO_BASE)

#else
#error "Please define APM32F40X or APM32F10X_CL"
#endif

/**@} end of group USB_Reg_Macros */
/**@} end of group USB_Reg */
/**@} end of group Driver */
/**@} end of group USB_OTG_Library */
#ifdef __cplusplus
}
#endif

#endif

